Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_regdef.h
/** \brief EMEM Module ID Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_RAM_MODID_Bits B;        /**< \brief Bitfield access */
} Ifx_EMEM_RAM_MODID;

/** \brief EMEM Region Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_RAM_RGNACCEN_RA_Bits B;    /**< \brief Bitfield access */
} Ifx_EMEM_RAM_RGNACCEN_RA;

/** \brief EMEM Region Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_RAM_RGNACCEN_RB_Bits B;    /**< \brief Bitfield access */
} Ifx_EMEM_RAM_RGNACCEN_RB;

/** \brief EMEM Region Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_RAM_RGN_ACCENWA_Bits B;    /**< \brief Bitfield access */
} Ifx_EMEM_RAM_RGN_ACCENWA;

/** \brief EMEM Region Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_RAM_RGN_ACCENWB_Bits B;    /**< \brief Bitfield access */
} Ifx_EMEM_RAM_RGN_ACCENWB;

/** \brief EMEM Region Lower Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_RAM_RGN_LA_Bits B;       /**< \brief Bitfield access */
} Ifx_EMEM_RAM_RGN_LA;

/** \brief EMEM Region Upper Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_RAM_RGN_UA_Bits B;       /**< \brief Bitfield access */
} Ifx_EMEM_RAM_RGN_UA;

/** \brief EMEM Safety Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EMEM_RAM_SCTRL_Bits B;        /**< \brief Bitfield access */
} Ifx_EMEM_RAM_SCTRL;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Emem_ram_RGN_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief RGN object */
typedef volatile struct _Ifx_EMEM_RAM_RGN
{
       Ifx_EMEM_RAM_RGN_LA                 LA;                     /**< \brief 0, EMEM Region Lower Address Register*/
       Ifx_EMEM_RAM_RGN_UA                 UA;                     /**< \brief 4, EMEM Region Upper Address Register*/
       Ifx_EMEM_RAM_RGN_ACCENWA            ACCENWA;                /**< \brief 8, EMEM Region Access Enable Register 0*/
       Ifx_EMEM_RAM_RGN_ACCENWB            ACCENWB;                /**< \brief C, EMEM Region Access Enable Register 1*/
} Ifx_EMEM_RAM_RGN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Emem_ram_RGNACCEN_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */
/** \brief RGNACCEN object */
typedef volatile struct _Ifx_EMEM_RAM_RGNACCEN
{
       Ifx_EMEM_RAM_RGNACCEN_RA            RA;                     /**< \brief 0, EMEM Region Access Enable Register 0*/
       Ifx_EMEM_RAM_RGNACCEN_RB            RB;                     /**< \brief 4, EMEM Region Access Enable Register 1*/
       Ifx_UReg_8Bit                       reserved_8[8];          /**< \brief 8, \internal Reserved */
} Ifx_EMEM_RAM_RGNACCEN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxLld_Emem_ram_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief EMEM_RAM object */
typedef volatile struct _Ifx_EMEM_RAM
{
       Ifx_EMEM_RAM_CLC                    CLC;                    /**< \brief 20000000, EMEM Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_20000004[4];    /**< \brief 20000004, \internal Reserved */
       Ifx_EMEM_RAM_MODID                  MODID;                  /**< \brief 20000008, EMEM Module ID Register*/
       Ifx_UReg_8Bit                       reserved_2000000C[4];    /**< \brief 2000000C, \internal Reserved */
       Ifx_EMEM_RAM_ACCEN0                 ACCEN0;                 /**< \brief 20000010, EMEM Access Enable Register 0*/
       Ifx_EMEM_RAM_ACCEN1                 ACCEN1;                 /**< \brief 20000014, EMEM Access Enable Register 1*/
       Ifx_UReg_8Bit                       reserved_20000018[8];    /**< \brief 20000018, \internal Reserved */
       Ifx_EMEM_RAM_MEMCON                 MEMCON;                 /**< \brief 20000020, EMEM Memory Control Register*/
       Ifx_EMEM_RAM_SCTRL                  SCTRL;                  /**< \brief 20000024, EMEM Safety Control Register*/
       Ifx_UReg_8Bit                       reserved_20000028[40];    /**< \brief 20000028, \internal Reserved */
       Ifx_EMEM_RAM_RGN                    RGN[8];                 /**< \brief 20000050, EMEM Region Access Enable Register 1*/
       Ifx_UReg_8Bit                       reserved_200000D0[8];    /**< \brief 200000D0, \internal Reserved */
       Ifx_EMEM_RAM_RGNACCEN               RGNACCEN[8];            /**< \brief 200000D8, */
} Ifx_EMEM_RAM;

/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEMEM_RAM_REGDEF_H */
